apps/shop/common/models/FrontSession.php

    public function start()
    {
        $cookies = Yii::$app->request->cookies;
        $sSessionID = $cookies->getValue("ShopERMFrontSessionID");

        if (!$sSessionID) {//新建cookie
            Yii::trace($sSessionID, 'cookie中ShopERMFrontSessionID不存在，新建ShopERMFrontSessionID');
            $sSessionID = $this->buildNounceString(12);
        }

        $session = static::find()->where(['ID' => $sSessionID])->one();
---
SELECT * FROM `FrontSession` WHERE `ID`='nUx6u5XCHJU2'