apps/shop/common/models/MallConfig.php

SELECT * FROM `MallConfig`
---
    public static function getAllConfig()
    {
        static::$arrConfig = \Yii::$app->cache->get("mallconfig");
        if (static::$arrConfig) {
            return static::$arrConfig;
        }

        static::$arrConfig = ArrayHelper::map(static::find()->asArray()->all(), 'sKey', 'sValue');