apps/shop/common/models/Member.php

    public static function AddRedBag($userID)
    {
        return 0;
        //88元满减券：满500抵50，满300抵30，满99抵10，满50抵5，满20抵2，满10抵1
        $redbag = Redbag::find()->where(['MemberID'=>$userID])->one();
---
SELECT * FROM `Redbag` WHERE `MemberID`=284