apps/shop/common/models/Order.php

    public function getStatusCount($MemberID)
    {
        $data = [];

        //未付款订单
        $data['lUnpaidCount'] = static::find()->where([
            'MemberID' => $MemberID,
            'StatusID' => static::STATUS_UNPAID
        ])->count();

        //已付款订单
        $data['lPaidCount'] = static::find()->leftJoin('sellerorder s','`order`.lID=s.OrderID')->where([
            '`order`.StatusID' => static::STATUS_PAID,'RefundStatusID' => null
        ])->andWhere(['or',['MemberID' => $MemberID],['s.SellerID' => $MemberID]])->count();

        //已发货订单
        $data['lShipCount'] = static::find()->leftJoin('sellerorder s','`order`.lID=s.OrderID')->where([
            '`order`.StatusID' => static::STATUS_DELIVERED
        ])->andWhere(['or',['MemberID' => $MemberID],['s.SellerID' => $MemberID]])->count();

        //已完成订单
        $data['lSuccessCount'] = static::find()->leftJoin('sellerorder s','`order`.lID=s.OrderID')->where([
            '`order`.StatusID' => static::STATUS_SUCCESS
        ])->andWhere(['or',['MemberID' => $MemberID],['s.SellerID' => $MemberID]])->count();
---
SELECT COUNT(*) FROM `Order` WHERE (`MemberID`=284) AND (`StatusID`='unpaid')
SELECT COUNT(*) FROM `Order` LEFT JOIN `sellerorder` `s` ON `order`.lID=s.OrderID WHERE ((`order`.`StatusID`='paid') AND (`RefundStatusID` IS NULL)) AND ((`MemberID`=44) OR (`s`.`SellerID`=44))
SELECT COUNT(*) FROM `Order` LEFT JOIN `sellerorder` `s` ON `order`.lID=s.OrderID WHERE (`order`.`StatusID`='delivered') AND ((`MemberID`=44) OR (`s`.`SellerID`=44))
SELECT COUNT(*) FROM `Order` LEFT JOIN `sellerorder` `s` ON `order`.lID=s.OrderID WHERE (`order`.`StatusID`='success') AND ((`MemberID`=44) OR (`s`.`SellerID`=44))