apps/shop/common/models/ProductParamValue.php

    public function getArrParamValue($ProductID)
    {
        $arrP = static::find()->where(['ProductID' => $ProductID])->with('param')->indexBy('ProductParamID')->all();
---
SELECT * FROM `ProductParamValue` WHERE `ProductID`='3086'