apps/shop/common/models/Product.php

    public function getFSalePriceold()
    {
        $fPrice = $this->fPrice;

        //默认取设置售价，若用户为代理则特殊处理
        $MemberID = \Yii::$app->frontsession->MemberID;
        $seller = Seller::findOne(['MemberID' => $MemberID]);
---
SELECT * FROM `Seller` WHERE `MemberID` IS NULL

    public function getFSalePrice()
    {
        $fPrice = $this->fPrice;

        //默认取设置售价，若用户为代理则特殊处理
        $MemberID = \Yii::$app->frontsession->MemberID;
        $seller = Seller::findOne(['MemberID' => $MemberID]);
---
SELECT * FROM `Seller` WHERE `MemberID`=284