apps/shop/common/models/Seller.php

SELECT * FROM `Member` WHERE 0=1
SELECT * FROM `Seller` WHERE `lID` IS NULL
SELECT * FROM `Seller` WHERE (`TypeID`=3) AND (`lID`='')
---
    public function getTopSeller()
    {
        if (\Yii::$app->frontsession->sShopUrl) {
            $shopID = str_replace("shop", "", \Yii::$app->frontsession->sShopUrl);
        } else {
            $shopID = \Yii::$app->frontsession->member->FromMemberID;
        }
        $seller = static::findOne($shopID);
        if ($seller->TypeID == 3) {
            return $shopID;
        } else {
            $upIDs = explode('/', $seller->PathID);
            $seller = static::find()->where(['and', ['TypeID' => 3], ['lID' => $upIDs]])->one();

SELECT * FROM `Seller` WHERE `lID`=44
---
    public function getSeller(){
        return self::findOne(\Yii::$app->frontsession->MemberID);