apps/shop/common/models/SellerShop.php

SELECT * FROM `SellerShop` WHERE `SellerID`=FALSE
---
    public function getShop($SellerID)
    {
        return self::findOne(['SellerID' => $SellerID]);