apps/shop/common/models/SellerOrder.php

INSERT INTO `SellerOrder` (`OrderID`, `dNewDate`, `StatusID`, `SellerID`, `PathID`, `fSellerCommission`, `lSellerCommissionRate`) VALUES (1828, '2020-02-23 01:05:16', 'unpaid', 284, '/284/', '9.324', 20)
---
            /* 计算代理分销提成，供应商结算金额 panlong 2019年9月11日11:30:54 结束 */
        }

        $sellerOrder->save();