apps/shop/mobile/models/Cart.php

SELECT SUM(lQuantity) FROM `Cart` WHERE `MemberID`=284
SELECT SUM(lQuantity) FROM `Cart` WHERE `SessionID`='VzKfe4HDKWk7'
---
    public function getLProductQty()
    {
        if (\Yii::$app->frontsession->bLogin) {
            return intval(static::find()->where(['MemberID' => \Yii::$app->frontsession->MemberID])->sum("lQuantity"));
        }

        return intval(static::find()->where(['SessionID' => \Yii::$app->frontsession->ID])->sum("lQuantity"));

SELECT * FROM `Cart` WHERE `MemberID`=284 ORDER BY `dNewDate` DESC
SELECT * FROM `Product` WHERE `lID` IN (3083, 3198)
---
    public function getCartProduct()
    {
        if (\Yii::$app->frontsession->bLogin) {
            $arrCartProduct = static::find()->where(['MemberID' => \Yii::$app->frontsession->MemberID])->with("product")->orderBy("dNewDate DESC")->all();

SELECT * FROM `Product` WHERE `lID`=3057
SELECT * FROM `ShipTemplate` WHERE `lID` IN (2280, 2279)
SELECT * FROM `Supplier` WHERE `lID` IN (655, 278)
---
    public function getProduct()
    {
        return $this->hasOne(\Yii::$app->product::className(),
            ['lID' => 'ProductID'])->with('shiptemplate')->with('nodelivery')->with('supplier');

UPDATE `Cart` SET `lQuantity`=4 WHERE `ID`='15819099470056590700136763944011'
---
    public function updateQty($CartID, $lQty)
    {
        $cart = static::findByID($CartID);
        $product = $cart->product;
        if ($product->lStock < $lQty) {
            return false;
        }

        static::updateAll(['lQuantity' => $lQty], ['ID' => $CartID]);

DELETE FROM `Cart` WHERE `ID` IS NULL
---
    public static function afterOrderSave(CommonEvent $event)
    {
        \Yii::trace("ttttt");
        $detail = $event->extraData;
        static::deleteAll(['ID' => $detail->CartID]);