apps/shop/mobile/models/MemberAddress.php

SELECT * FROM `MemberAddress` WHERE (`MemberID`=284) AND (`bDefault`=1)
---
    public function getDefAddress()
    {
        return static::findOne(['MemberID' => \Yii::$app->frontsession->MemberID, 'bDefault' => 1]);

SELECT * FROM `MemberAddress` WHERE `MemberID`=44 ORDER BY `dEditDate` DESC
---
    public function findAllAddress()
    {
        return static::find()->where(['MemberID' => \Yii::$app->frontsession->MemberID])->orderBy("dEditDate DESC")->all();