apps/shop/mobile/models/Order.php

            $order->bHasSaved = 0;//Mars，2019年3月29日14:50:40，设置成0，数据库查询会更高效
            $order->OrderType = $arrParam['OrderType'];
            $order->fService = 0;
            $order->save();
---
INSERT INTO `Order` (`sTradeNo`, `sName`, `dNewDate`, `dEditDate`, `MemberID`, `SupplierID`, `StatusID`, `fShip`, `fSumOrder`, `fSupplierShip`, `fPaid`, `sMessage`, `bCloud`, `sIP`, `bHasSaved`, `OrderType`, `fService`) VALUES ('ACT2020022301051633302', '2020022301051673212', '2020-02-23 01:05:16', '2020-02-23 01:05:16', 284, 655, 'unpaid', '14', '14', '14', '0', '', 1, '127.0.0.1', 0, 1, '0')

                    }
                    $order->fSumOrder -= $redProduct->fChange * $lCount;//抵扣金额
                }
                $orderDetail->save();
---
INSERT INTO `OrderDetail` (`sName`, `ProductID`, `OrderID`, `sPic`, `sSKU`, `lQuantity`, `fPrice`, `fTotal`, `fProfit`) VALUES ('黄则和厦门花生汤罐头250g*6罐营养早餐饮品开罐即食散装', 3086, 1828, 'userfile/upload/2020-01-10/15786479230022831300189915821120.jpg', '', '1', '36.00', '36', '5.4')

                if ($product->lStock < 0) {
                    $product->lStock = 0;
                }
                $product->save();
---
UPDATE `Product` SET `lStock`=965 WHERE `lID`=3086

                $event->extraData = $orderDetail;//传值订单明细
                \Yii::$app->orderdetail->trigger(static::EVENT_SAVE_ORDER, $event);
                //清除购物车
                $cart = Cart::findOne($cProduct->CartID);
---
SELECT * FROM `Cart` WHERE `ID` IS NULL

            //满减券
            if ($arrParam['redbagID']) {
                $redbagID = $arrParam['redbagID'];
                $redbag = Redbag::find()->where(['and', ['MemberID' => \Yii::$app->frontsession->MemberID], ['bUserd' => 0], ['lID' => $redbagID]])->one();
---
SELECT * FROM `Redbag` WHERE (`MemberID`=284) AND (`bUserd`=0) AND (`lID`='5')

                    $order->fDue -= $redbag->fChange;
                    $redbag->bUserd = 1;
                    $redbag->OrderID = $order->lID;
                    $redbag->save();
                }
            }
            $order->save();
---
UPDATE `Redbag` SET `bUserd`=1, `OrderID`=1828 WHERE `lID`=5
UPDATE `Order` SET `OrderAddressID`=1820 WHERE `lID`=1828

            $orderAddress->AreaID = $address->AreaID;
            $orderAddress->sAddress = $address->sAddress;
            $orderAddress->sMobile = $address->sMobile;
            $orderAddress->save();
---
INSERT INTO `OrderAddress` (`sName`, `OrderID`, `MemberID`, `ProvinceID`, `CityID`, `AreaID`, `sAddress`, `sMobile`) VALUES ('张三鱼鱼', 1828, 284, 350000, 350200, 350205, 'ces', '15707277173')

                $groupMember->MemberID = $order->MemberID;
                $groupMember->GroupID = $checkoutProduct[0]['GroupID'];
                $groupMember->OrderID = $order->lID;
                $groupMember->save();
---
INSERT INTO `GroupMember` (`MemberID`, `GroupID`, `OrderID`) VALUES (284, 125, 1828)

    public function memberList($config)
    {
        $sKeyword = $config['sKeyword'];
        $MemberID = $config['MemberID'];
        $StatusID = $config['StatusID'];
        $lPage = intval($config['lPage']) > 1 ? intval($config['lPage']) : 1;

        $r = static::find()->where(['MemberID' => $MemberID]);

        if ($StatusID) {
            $r->andWhere(['StatusID' => $StatusID]);
            if ($StatusID == 'paid') {
                $r->andWhere(['RefundStatusID' => null]);
            }
        }

        if (strlen($sKeyword) > 0) {
            $r->andWhere("lID IN (SELECT OrderID FROM OrderAddress WHERE MemberID='$MemberID' AND (sName='" . addslashes($sKeyword) . "' OR sMobile='" . addslashes($sKeyword) . "'))");
        }

        $lCount = $r->count();

        $r->offset(($lPage - 1) * 10)->limit(10);
        $r->with('arrDetail');
        $r->orderBy("dNewDate DESC");
        $arrOrder = $r->all();
---
SELECT COUNT(*) FROM `Order` WHERE (`MemberID`=44) AND (`StatusID`='unpaid')
SELECT * FROM `Order` WHERE (`MemberID`=44) AND (`StatusID`='unpaid') ORDER BY `dNewDate` DESC LIMIT 10

    public function getProfitorder($config)
    {
        $MemberID = $config['MemberID'];
        $StatusID = $config['StatusID'];
        $lPage = intval($config['lPage']) > 1 ? intval($config['lPage']) : 1;
        $res = SellerOrder::find()->select('OrderID')
            ->where(['or', ['SellerID' => $MemberID], ['UpSellerID' => $MemberID]])
            ->asArray()
            ->offset(($lPage - 1) * 10)
            ->limit(10)
            ->orderBy('OrderID desc');
        if ($StatusID) {
            $res->andWhere(['StatusID' => $StatusID]);
        }
        $res->andWhere(['<>', 'StatusID', 'closed']);

        $sellerOrder = $res->all();
        $orderIDList = array_column($sellerOrder, 'OrderID');
        $r = static::find()->where(['lID' => $orderIDList]);

        if ($StatusID) {
            $r->andWhere(['StatusID' => $StatusID]);
        }
        $r->with('arrDetail');
        $r->with('member');
        $r->with('seller');
        $this->MemberID = $MemberID;
        $r->with(['sellerFlow' => function ($query) {
            $query->where(['SellerID' => $this->MemberID]);
        }]);
---
SELECT `OrderID` FROM `SellerOrder` WHERE ((`SellerID`=284) OR (`UpSellerID`=284)) AND (`StatusID`='unpaid') AND (`StatusID` <> 'closed') ORDER BY `OrderID` DESC LIMIT 10
SELECT * FROM `Member` WHERE `lID`=3915
SELECT * FROM `SellerFlow` WHERE (`SellerID`=284) AND (`OrderID` IN (1850, 1849))
SELECT * FROM `Seller` WHERE `lID`=284

    public function getSeller()
    {
        return $this->hasOne(SellerOrder::className(), ['OrderID' => 'lID'])->with('seller');
---
SELECT * FROM `SellerOrder` WHERE `OrderID` IN (1850, 1849)