apps/shop/mobile/models/OrderCheckout.php

	public function getArrCheckoutProduct()
	{
		return static::find()->where(['SessionID' => \Yii::$app->frontsession->ID])->orderBy("dNewDate DESC")->with('product')->all();
---
SELECT * FROM `OrderCheckout` WHERE `SessionID`='BuVhaX2IOmLb' ORDER BY `dNewDate` DESC
SELECT * FROM `Product` WHERE `lID` IN (3086, 3085)

	public function getProduct()
	{
		return $this->hasOne(\Yii::$app->product::className(),
			['lID' => 'ProductID'])->with('shiptemplate')->with('nodelivery')->with('supplier');
---
SELECT * FROM `Product` WHERE `lID`=808
SELECT * FROM `ShipTemplate` WHERE `lID`=2279
SELECT * FROM `Supplier` WHERE `lID`=655