apps/shop/mobile/models/Product.php

SELECT * FROM `Product` WHERE (`bSale`=1) AND (`bCheck`=1) AND ((`bDel`=0) AND (`bGroup`=1)) ORDER BY `lClick` DESC, `dEditDate` DESC LIMIT 10
---
    public function getWholesaleProduct($page = 1, $type = 0)
    {
        $data = [];
        $data['bDel'] = 0;
        if ($type == 1) {
            $data['bGroup'] = 1;
            //$data['SupplierID'] = 767;
        } elseif ($type == 2) {
            $data['lBulk'] = 1;
        }
        return self::find()
            ->where(['and', ['bSale' => 1], ['bCheck' => 1]])
            ->andWhere($data)
            ->orderBy('lClick desc,dEditDate desc')
            ->limit(10)
            ->offset(($page - 1) * 10)
            ->all();

SELECT * FROM `RecommendProduct` WHERE `lID`=9
---
    public function getFGroupPrice()
    {
        $fPrice = $this->fPrice;
        $recomProduct = RecommendProduct::findOne(9);