apps/shop/mobile/models/ProductSpecification.php

    public function getArrSpec($ProductID, $sMasterPic = '')
    {
        $ProductSpec = ProductSpecification::find()
            ->where(['ProductID' => $ProductID])
            ->asArray()
            ->orderBy('lPos')
            ->all();
---
SELECT * FROM `ProductSpecification` WHERE `ProductID`='3086' ORDER BY `lPos`