apps/shop/mobile/models/Redbagproduct.php

    public static function addRedbagproduct()
    {
        $res = 0;
        $recomend = RecommendProduct::findOne(9);
        $date = \Yii::$app->formatter->asDatetime(time());
        if($recomend->dEnd > $date) {
            $recomendDetail = RecommendProductDetail::findAll(['RecommendID' => 9]);
---
SELECT * FROM `RecommendProduct` WHERE `lID`=9
SELECT * FROM `RecommendProductDetail` WHERE `RecommendID`=9