apps/shop/mobile/models/Refund.php

    public function getLRefundCount()
    {
        return static::find()->where(['MemberID' => \Yii::$app->frontsession->MemberID])->andWhere([
            'not in',
            'StatusID',
            ['closed', 'success']
        ])->count();
---
SELECT COUNT(*) FROM `Refund` WHERE (`MemberID`=284) AND (`StatusID` NOT IN ('closed', 'success'))