apps/shop/mobile/models/ShipTemplate.php

SELECT * FROM `ShipTemplate` WHERE `lID`=2279
---
    public static function getShipCount($param = [])
    {
        //运送方式
        $ShipMethod = 'EXPRESS';
        //运费模板ID
        $ShipTemplateID = $param['ShipTemplateID'];

        //返回数据初始化
        $ShipMoney = 0.00;
        $result = [];
        $result['status'] = 1;

        if (!$param['CityName'] && !$param['CityID'] || !$param['ShipTemplateID'] || !$param['Number'] || !$param['fTotalMoney']) {
            $result['status'] = -1;
            $result['msg'] = "地址信息缺失";
            return $result;
        }

        //获取运费模板
        $arrShipTemplate = ShipTemplate::find()
            ->where(["lID" => $ShipTemplateID])
            ->asArray()
            ->one();

SELECT `lID` FROM `ShipTemplateNoDelivery` WHERE (`ShipTemplateID`=2279) AND (`sAreaID` LIKE '%350200%')
---
        }

        //判断该地区是否发货
        $NoDelivery = ShipTemplateNoDelivery::find()
            ->select('lID')
            ->where(['ShipTemplateID' => $ShipTemplateID])
            ->andWhere(['like', 'sAreaID', $City['ID']])
            ->asArray()
            ->one();

SELECT * FROM `ShipTemplateDetail` WHERE ((`ShipTemplateID`=2279) AND (`sShipMethod`='EXPRESS') AND (`sType`='designatedArea')) AND (`sAreaID` LIKE '%,350200,%')
---
            return $result;
        }
        //判断指定地区是否存在
        $ShipTemplateDetailSet = ShipTemplateDetail::find()
            ->where(['ShipTemplateID' => $ShipTemplateID, 'sShipMethod' => $ShipMethod, 'sType' => 'designatedArea'])
            ->andWhere(['like', 'sAreaID', ',' . $City['ID'] . ','])
            ->asArray()
            ->one();

SELECT * FROM `ShipTemplateDetail` WHERE (`ShipTemplateID`=1199) AND (`sShipMethod`='EXPRESS') AND (`sType`='default')
---
            $ShipMoney = self::getShipMoney($ShipTemplateDetailSet);
        } else {
            //计算默认运费
            $defaultShip = ShipTemplateDetail::find()
                ->where(['ShipTemplateID' => $ShipTemplateID, 'sShipMethod' => $ShipMethod, 'sType' => 'default'])
                ->asArray()
                ->one();