apps/shop/common/models/debug/ShopDebug.php

INSERT INTO `ShopDebug` (`ID`, `sName`, `MemberID`, `SessionID`, `dNewDate`, `bAjax`, `sMethod`, `sIP`, `sStatusCode`, `lSQLCount`, `lMailCount`, `sSavePath`, `lTimeUse`) VALUES ('5e986ff1094f6', 'http://m.laisanjin.net/userfile/upload/2019-12-23/15770918440080634500191121557499.jpg', 44, 'o5sJVAtR9GrG', '2020-04-16 22:47:12', 0, 'GET', '127.0.0.1', '404', 15, 0, 'F:\\DNY\\DNY\\apps\\shop\\mobile\\web/../../../common/runtime/debug/2020-04-16/5e986ff1094f6.data', 87)
---
    public function saveDebugData($arrCollectSummary)
    {
        $this->setAttributes($arrCollectSummary, false);

        if ($this->validate()) {
            $this->save();