apps/shop/mobile/controllers/CartController.php

SELECT * FROM `Redbag` WHERE (`MemberID`=284) AND (`bUserd`=0) ORDER BY `fChange` DESC
---
            }
        }

        $arrRed = Redbag::find()->where(['and', ['MemberID' => \Yii::$app->frontsession->MemberID], ['bUserd' => 0]])->orderBy('fChange desc')->asArray()->all();

SELECT * FROM `RecommendProduct` WHERE `lID`=9
---
    public function actionIndex()
    {
        $data = [];

        //组装前端要的数据
        $data['arrSupplier'] = [];
        $data['arrInvalid'] = [];
        $date = \Yii::$app->formatter->asDatetime(time());
        $recommendProduct = RecommendProduct::findOne(9);

SELECT * FROM `Redbagproduct` WHERE (`MemberID`=284) AND (`dEnd` > '2020-04-20 00:04:59')
---
        $date = \Yii::$app->formatter->asDatetime(time());
        $data['arrRed'] = [];
        $data['redProduct'] = [];
        $redProduct = Redbagproduct::find()->where(['and', ['MemberID' => \Yii::$app->frontsession->MemberID], ['>', 'dEnd', $date]])->asArray()->all();

SELECT * FROM `Redbagproduct` WHERE (`MemberID`=284) AND (`dEnd` > '2020-04-20 00:04:59')
---
            $data['redProduct'] = $redProduct;
        } elseif (!$redProduct) {
            $bRedProduct = Redbagproduct::addRedbagproduct();
            $redProduct = Redbagproduct::find()->where(['and', ['MemberID' => \Yii::$app->frontsession->MemberID], ['>', 'dEnd', $date]])->asArray()->all();

SELECT * FROM `Redbag` WHERE (`MemberID`=284) AND (`bUserd`=0) ORDER BY `fChange` DESC
---
        }
        if (!$redProduct) {
            //通用券
            $arrRed = Redbag::find()->where(['and', ['MemberID' => \Yii::$app->frontsession->MemberID], ['bUserd' => 0]])->orderBy('fChange desc')->asArray()->all();

SELECT * FROM `Member` WHERE `lID`=284
SELECT * FROM `Seller` WHERE `lID`=284
---

        //团长信息
        $MemberID = \Yii::$app->frontsession->MemberID;
        $seller = Seller::findOne(['lID' => $MemberID]);

SELECT * FROM `Groupaddress` WHERE `MemberID`=284
SELECT * FROM `Order` ORDER BY `dNewDate` DESC LIMIT 60
---
        $data['shop'] = $seller;
        $data['shoptitle'] = $seller->sName;

        $data['groupaddress'] = Groupaddress::findOne(['MemberID' => $seller->lID]);
        $data['member'] = $seller->member;

        $arrOrder = Order::find()->orderBy('dNewDate desc')->limit(60)->all();