apps/shop/mobile/controllers/Controller.php

SELECT * FROM `Seller` WHERE `lID`='284'
---
    public function beforeAction($action)
    {
        if (parent::beforeAction($action)) {
            //在微信端下，任何界面都必须要登录
            if (\Yii::$app->params['isWeChat'] && !\Yii::$app->frontsession->bWXLogin && $action->id != "loginpost") {
                $this->redirect(Url::toRoute([
                    \Yii::$app->request->shopUrl . '/member/loginpost',
                    'sReturnUrl' => \Yii::$app->request->rootUrl . \Yii::$app->request->url
                ], true));
            }

            //判断当前用户是否经销商，如果是，则要跳转到他自己的链接
            if (\Yii::$app->frontsession->bLogin && isset($_GET['sShopUrl'])) {
                $sellerShop = \Yii::$app->sellershop->findByID(\Yii::$app->frontsession->MemberID);