apps/shop/mobile/controllers/HomeController.php

SELECT * FROM `Product` WHERE `lID` IN (3057, 3058, 3059)
SELECT * FROM `RecommendProductDetail` WHERE `RecommendID`=9 ORDER BY `lSort` DESC
---
    public function getGroupProduct()
    {
        $data = [];
        $data['msg'] = "操作成功";
        $data['status'] = 0;
        $data['isMore'] = false;
        $data['data'] = [];
        $data['data']['commodity'] = [];
        $data['data']['sellout'] = [];
        $arrRecommed = RecommendProductDetail::find()->where(['RecommendID' => 9])->with('product')->orderBy('lSort desc')->all();

SELECT * FROM `RecommendProduct` WHERE `lID`=9
SELECT * FROM `SellerShop` WHERE `lID`=284
---
    public function actionIndex()
    {
        $data = [];
        //轮播图
        $data['arrScrollImage'] = json_decode(MallConfig::getValueByKey("sScrollImageConfig"), true);

        //获取第一个商品列表配置
        $data['arrProduct'] = $this->getGroupProduct();

        //如果又开团数据，开团
        $bRedProduct = 0;
        $date = \Yii::$app->formatter->asDatetime(time());
        $recommendProduct = RecommendProduct::findOne(9);
        $timerDate = $recommendProduct->dStrart;
        $timerMsg = '距开始';
        if ($date > $recommendProduct->dStrart && $date < $recommendProduct->dEnd) {
            $timerDate = $recommendProduct->dEnd;
            $timerMsg = '距截单';
        }
        $data['timerDate'] = $timerDate;
        $data['timerMsg'] = $timerMsg;
        $data['buyers'] = '';
        $MemberID = \Yii::$app->frontsession->MemberID;
        if (empty($MemberID)) {
//            $this->redirect(Url::toRoute([
//                \Yii::$app->request->shopUrl . '/member/loginpost',
//                'sReturnUrl' => \Yii::$app->request->rootUrl . \Yii::$app->request->url
//            ], true));
//            return;
        }
        $seller = SellerShop::findOne(['lID' => $MemberID]);

SELECT * FROM `Groupaddress` WHERE `MemberID`=284
---
        if ($data['arrProduct']['status']) {
            //团长地址是否显示
            $bAddressShow = 0;
            $groupAddress = Groupaddress::findOne(['MemberID' => $MemberID]);

SELECT * FROM `Order` ORDER BY `dNewDate` DESC LIMIT 60
---
            }
            $data['bAddressShow'] = $bAddressShow;

            $arrOrder = Order::find()->orderBy('dNewDate desc')->limit(60)->all();

SELECT * FROM `Redbagproduct` WHERE (`MemberID`=284) AND (`dEnd` > '2020-04-19 23:36:32')
---
            $data['buyers'] = json_encode($buyers);

            //商品券
            $redProduct = Redbagproduct::find()->where(['and', ['MemberID' => \Yii::$app->frontsession->MemberID], ['>', 'dEnd', $date]])->asArray()->all();

SELECT SUM(lQuantity) FROM `Cart` WHERE `MemberID`=284
---

        }
        $data['bRedProduct'] = $bRedProduct;
        $cartNo=Cart::find()->where(['MemberID'=>$MemberID])->sum('lQuantity');

SELECT * FROM `Groupaddress` WHERE lID not in(1847,
1850,
1851,
1856,
1863,
1880)
---
    public function actionSelect()
    {
        $data = [];
        $data['arrGroupaddress'] = Groupaddress::find()->where("lID not in(1847,
1850,
1851,
1856,
1863,
1880)")->all();