apps/shop/mobile/controllers/MemberController.php

SELECT * FROM `Member` WHERE `lID`=44
SELECT * FROM `Seller` WHERE `MemberID`=44
SELECT SUM(OrderDetail.lQuantity) FROM `order` LEFT JOIN `ylcloud`.`OrderDetail` ON Order.lID=OrderDetail.OrderID WHERE (`Order`.`StatusID`='paid') AND (`Order`.`SupplierID`=655)
---
    public function actionIndex()
    {
        $this->getView()->title = "个人中心";
        $data = [];
        $data['member'] = \Yii::$app->frontsession->member;
        if (\Yii::$app->frontsession->MemberID) {
            $data['arrStatusCount'] = \Yii::$app->order->getStatusCount(\Yii::$app->frontsession->MemberID);
        }
        $seller = Seller::findOne(['MemberID' => \Yii::$app->frontsession->MemberID]);
        $data['seller'] = $seller;
        if ($seller && $seller->TypeID == Seller::TOP) {
            $data['bTop'] = true;
            $data['seller'] = \Yii::$app->seller->seller;
            $data['shop'] = \Yii::$app->sellershop->getShop($seller->lID);
            $supplierID = \Yii::$app->frontsession->member->SupplierID;

            $unDelivere = CloudOrder::find()
                ->where(['Order.StatusID' => 'paid', 'Order.SupplierID' => $supplierID])
                ->leftJoin('ylcloud.OrderDetail', 'Order.lID=OrderDetail.OrderID')
                ->sum('OrderDetail.lQuantity');

SELECT * FROM `SellerShop` WHERE `lID`=44
---
    public function actionOrderlistmore()
    {
        if (!in_array($_GET['type'], ['unpaid', 'paid', 'closed', 'delivered', 'success', 'refund'])) {
            $_GET['type'] = "";
        }
        $seller = SellerShop::findOne(['lID' => \Yii::$app->frontsession->MemberID]);