apps/shop/mobile/controllers/ProductController.php

    public function actionSetgroup()
    {
        $ProductID = $_POST['ProductID'];
        $ProductName = $_POST['sName'];
        $MemberID = \Yii::$app->frontsession->MemberID;
        $recommend = RecommendProduct::findOne(9);
---
SELECT * FROM `Product` WHERE `lID`='3086'

    public function actionDetailsingle()
    {
        $product = \Yii::$app->product->findByID(3211);
        //1、非代理回首页
        $memberID = \Yii::$app->frontsession->MemberID;
        if (empty($memberID)) {
            $this->redirect(Url::toRoute([
                \Yii::$app->request->shopUrl . '/member/loginpost',
                'sReturnUrl' => \Yii::$app->request->rootUrl . \Yii::$app->request->url
            ], true));
	    return;
        }
        $seller = Seller::findOne($memberID);
        if (!$seller) {
            $this->redirect(Url::toRoute([\Yii::$app->request->shopUrl . "/home/home"], true));
            return;
        }
        //2、已买过回首页
        $arrOrder = Order::find()->alias('o')->select('o.lID,o.StatusID,lQuantity')
            ->leftJoin('orderdetail', 'orderdetail.OrderID=o.lID')
            ->where("o.MemberID=$memberID and o.StatusID<>'closed' and orderdetail.ProductID=3211")
            ->all();
        if ($arrOrder) {
            $totalNum = 0;
            foreach ($arrOrder as $order) {
                if ($order->StatusID == 'unpaid') {
                    Order::updateAll(
                        [
                            'StatusID' => Order::STATUS_CLOSED,
                            'dCloseDate' => \Yii::$app->formatter->asDatetime(time()),
                            'sCloseReson' => '自动关闭'
                        ], ['lID' => $order->lID]);
---
SELECT * FROM `Seller` WHERE `lID`=284
SELECT `o`.`lID`, `o`.`StatusID` FROM `Order` `o` LEFT JOIN `orderdetail` ON orderdetail.OrderID=o.lID WHERE o.MemberID=284 and o.StatusID<>'closed' and orderdetail.ProductID=808
UPDATE `Order` SET `StatusID`='closed', `dCloseDate`='2020-02-26 00:44:07', `sCloseReson`='自动关闭' WHERE `lID`=1834

    public function actionDetailgroup($id)
    {
        $product = \Yii::$app->product->findByID($id);
        $data['fShowSalePrice'] = number_format($product->fSalePrice, 2);
        $data['bWholesale'] = 1;
        //商品详情
        if (!$id || !$product || $product->bDel) {
            $this->getView()->title = "商品已删除";
            return $this->render('del');
        }
        /* @var Product $product */
        $data['product'] = $product;
        //售后说明
        $data['sAfterSaleNote'] = MallConfig::getValueByKey("sAfterSaleNote");
        $this->getView()->title = '来瓜分';
        $data['logo'] = \Yii::$app->request->imgUrl . '/' . \myerm\shop\common\models\MallConfig::getValueByKey("sMallLogo");
        $arrOrder = Order::find()->orderBy('dNewDate desc')->limit(60)->all();
        $buyers = [];
        foreach ($arrOrder as $key => $order) {
            $member = $order->member;
            $buyers[$key]['logo'] = $member->sAvatarPath;
            $buyers[$key]['sName'] = $member->sName;
        }
        $data['buyers'] = json_encode($buyers);
        $date = \Yii::$app->formatter->asDatetime(time());
        $recommendProduct = RecommendProduct::findOne(9);
---
SELECT * FROM `Order` ORDER BY `dNewDate` DESC LIMIT 60
SELECT * FROM `RecommendProduct` WHERE `lID`=9