<?php

namespace myerm\backend\{对象模块小写}\{对象ID小写};

/**
 * 模型类-{对象名称}
 * ============================================================================
 * 版权所有 2010-2017 三只象（厦门）网络科技有限公司，并保留所有权利。
 * 网站地址: http://www.myerm.cn
 * ----------------------------------------------------------------------------
 * 这不是一个自由软件！您只能在不用于商业目的的前提下对程序代码进行修改和
 * 使用；不允许对程序代码以任何形式任何目的的再发布。
 * ============================================================================
 * @author MyERM
 * @since {时间}
 * @version v2.0
 */
class {对象ID} extends \myerm\backend\common\Model
{

}
